Vulnerability-report-main/Eligibility-Batch-ESB/ESB-Batch-routes/src/main/resources/ca/gov/moh/hsa/esb/service/batch/batchResponseTemplate.vm

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
    </soap:Header>
    <soap:Body>

        <v3:MCCI_IN200101BC ITSVersion="XML_1.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:v3="urn:hl7-org:v3">
            <v3:id root="2.16.840.1.113883.3.51.1.1.1" extension="${headers.HSA_TRANSACTION_ID}"/>
            <v3:creationTime value="${body.timestamp}"/>
            <v3:responseModeCode code="I"/>
            <v3:versionCode code="Ballot2012May"/>
            <v3:interactionId root="2.16.840.1.113883.3.51.1.1.2" extension="QUCR_IN200101BC"/>
            <v3:profileId root="2.16.840.1.113883.3.51.7" extension="BC.CR.BATCH.R1.1"/>
            <v3:transmissionQuantity value="2"/>

            ${body.getEligibilityResponse}
            ${body.getDemographicsResponse}
	
            <v3:receiver typeCode="RCV">
                <v3:device classCode="DEV" determinerCode="INSTANCE">
                    <v3:id root="${headers.SENDING_DEVICE_OID}" extension="${headers.SENDING_DEVICE}"/>
                    <v3:asAgent classCode="AGNT">
                        <v3:representedOrganization classCode="ORG" determinerCode="INSTANCE">
                            <v3:id root="${headers.SENDING_ORG_OID}" extension="${headers.SENDING_ORG}"/>
                        </v3:representedOrganization>
                    </v3:asAgent>
                </v3:device>
            </v3:receiver>
            <v3:sender typeCode="SND">
                <v3:device classCode="DEV" determinerCode="INSTANCE">
                    <v3:id root="2.16.840.1.113883.3.51.1.1.5" extension="BCHCIM"/>
                    <v3:asAgent classCode="AGNT">
                        <v3:representedOrganization classCode="ORG" determinerCode="INSTANCE">
                            <v3:id root="2.16.840.1.113883.3.51.1.1.200" extension="MOH"/>
                        </v3:representedOrganization>
                    </v3:asAgent>
                </v3:device>
            </v3:sender>
            #if($body.responseCode=="AA")
            <v3:acknowledgement typeCode="AA">
                <v3:targetBatch>
                    <v3:id root="2.16.840.1.113883.3.51.1.1.1"  extension="${headers.BATCH_ID}"/>
                </v3:targetBatch>
                <v3:acknowledgementDetail typeCode="I">
                    <v3:code code="MSG-0029">
                        <v3:originalText>The batch request has been successfully processed.</v3:originalText>
                    </v3:code>
                </v3:acknowledgementDetail>
            </v3:acknowledgement>
            #else
            <v3:acknowledgement typeCode="AR">
                <v3:targetMessage>
                    <v3:id root="2.16.840.1.113883.3.51.1.1.1" extension="${headers.BATCH_ID}"/>
                </v3:targetMessage>
                <v3:acknowledgementDetail typeCode="E">
                    <v3:code code="INTERR" displayName="Internal Error">
                        <v3:originalText>An internal software component (database, application, queue mechanism, etc.) has failed, leading to inability to process the message.</v3:originalText>
                    </v3:code>
                </v3:acknowledgementDetail>      
            </v3:acknowledgement>
            #end      
        </v3:MCCI_IN200101BC>
    </soap:Body>
</soap:Envelope>